🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / templates module-resource ](http://pr14148.dev.env0.com/p/78dadb7c-5f6b-4a7d-aec0-a15e2bff5530/environments/dbdb5701-0b92-4207-8953-40c274717ade):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform will perform the following actions:


  # aws_instance.example_server will be created
+   resource "aws_instance" "example_server" {
+       ami                                  = "ami-04e914639d0cca79a"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "AnotherTag" = "AnotherVasdlue"
+           "Name"       = "JacksBlogExample"
        }
+       tags_all                             = {
+           "AnotherTag" = "AnotherVasdlue"
+           "Name"       = "JacksBlogExample"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

  # null_resource.test will be created
+   resource "null_resource" "test" {
+       id       = (known after apply)
+       triggers = {
+           "timestamp" = (known after apply)
        }
    }

  # module.nuller.null_resource.nuller will be created
+   resource "null_resource" "nuller" {
+       id       = (known after apply)
+       triggers = {
+           "timestamp" = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   bucket         = (known after apply)
+   nuller_complex = {
+       foo     = "12"
+       lalalal = false
    }
+   nuller_id      = (known after apply)
+   tag            = {
+       AnotherTag = "AnotherVasdlue"
+       Name       = "JacksBlogExample"
    }
+   this           = (known after apply)
```
</details>


```
Monthly cost change for tomer-landesman/templates/.env0workdir/env0_tf_plan.json
Amount:  +$9 ($0.00 → $9)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
──────────────────────────────────
Project: tomer-landesman/templates/.env0workdir/env0_tf_plan.json

+ aws_instance.example_server
  +$9

+     Instance usage (Linux/UNIX, on-demand, t2.micro)
      +$8

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for tomer-landesman/templates/.env0workdir/env0_tf_plan.json
Amount:  +$9 ($0.00 → $9)

──────────────────────────────────
Key: ~ changed, + added, - removed

1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

Infracost estimate: Monthly cost will increase by $9 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━┓
┃ Project                                                  ┃ Cost change ┃ New monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━━━━┫
┃ tomer-landesman/templates/.env0workdir/env0_tf_plan.json ┃         +$9 ┃ $9               ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━━━━┛
```
</details>


[Full PR Plan logs on env0](http://pr14148.dev.env0.com/p/78dadb7c-5f6b-4a7d-aec0-a15e2bff5530/environments/dbdb5701-0b92-4207-8953-40c274717ade/deployments/b83514a9-0912-4318-bd0e-214e445a0670)